#streamlit을 쓰는 이유: 배포가 쉬움. flask는 배포가 어려움.
#css style을 이용해서 글자 크기를 조정하거나, 글자 색깔을 바꿀 수 있음.
import streamlit as st
import pandas as pd
#pandas 그래프, 차트 그릴 때 사용, numby는 수치 계산 할 때 사용
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
#pip install matplotlib seaborn

# 1. 한글 폰트 설정 (이게 없으면 그래프 제목이 깨져요!)
plt.rc('font', family='Malgun Gothic') 
plt.rcParams['axes.unicode_minus'] = False # 마이너스 기호 깨짐 방지

st.title("📊국세청 근로소득 데이터 분석기")

#데이터 불러오기
file_path="국세청_근로소득 백분위(천분위) 자료_20241231.csv"
#app.py와 csv 파일이 같은 폴더에 있어야 함.

#file_path="./data/국세청_근로소득 백분위(천분위) 자료_20241231.csv"
#data 폴더를 만들어서 그 안에 csv 파일을 넣어뒀을 때 해석: ./현재 위치에 data/ 폴더안에 있는 csv 파일
try:
   #자료 읽기
   df=pd.read_csv(file_path,encoding='cp949')
   st.success("✅데이터를 성공적으로 불러 왔습니다!✅")

   #데이터 미리 보기
   st.subheader("✔️데이터를 확인하기")
   st.dataframe(df.head())   #표 상단 5줄 보여주기

   #데이터 분석 그래프 그리기
   st.subheader("📉항목별 분포 그래프")
   #분석하고 싶은 열 이름 선택
   #예를 들어 급여나 인원 같은 숫자 데이터가 있는 칸을 골라야 한다.
   
   column_names =df.columns.tolist()  #columns 열 이름들을 모아서 리스트로 만들겠다.
   selected_col=st.selectbox("분석할 항목을 선택하세요:", column_names)

   #그래프 그리기(seaborn 사용)
   fig, ax=plt.subplots(figsize=(10,5)) #fig 그래프의 전체사이즈 #ax 그래프의 축
   sns.histplot(df[selected_col],ax=ax, color="#cc00ff") #16진수 칼라표
   
   plt.title(f"[{selected_col}] 분포확인") #그래프 맨 위에 제목
   plt.xlabel(selected_col) #x축 제목 (예:급여액)
   plt.ylabel("빈도수") #y축 제목 얼마나 자주 나오는지..

   #스트림릿 웹 화면에 그래프 표시
   st.pyplot(fig)

except FileNotFoundError:
    st.error("❌데이터 파일을 찾을 수 없습니다. 파일 경로를 확인해 주세요.❌")
except Exception as e:
    st.error(f"❌데이터를 불러오는 중에 오류가 발생했습니다: {e}❌")
#오류가 없으면 try 실행, 오류가 있으면 except 실행
#r,g,b 0-255 15진법 0~15 8,9,10,15 a,b,c,d...f
#red일 경우 r 255 g00 b00 ->#ff0000 red
